Autodesk.Revit.DB.SubTransaction.#ctor(Autodesk.Revit.DB.Document)
Instantiates a sub-transaction object
document:
The document for which this sub-transaction is going to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011